# 题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；
# 利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
# 20万到40万之间时，高于20万元的部分，可提成5%；
# 40万到60万之间时高于40万元的部分，可提成3%；
# 60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，
# 从键盘输入当月利润I，求应发放奖金总数？

# I = int(input("请输入月利润："))
# award = 0
# if I > 10:
#     if I > 20:
#         if I > 40:
#             if I > 60:
#                 if I > 100:
#                     award += (I - 100) * 0.01
#                     I = 100
#                 award += (I - 60) * 0.015
#                 I = 60
#             award += (I - 40) * 0.03
#             I = 40
#         award += (I - 20) * 0.05
#         I = 20
#     award += (I - 10) * 0.075
#     I = 10
# award += I * 0.1
# print(award)

# 答案
# i = int(input('净利润:'))
# arr = [1000000, 600000, 400000, 200000, 100000, 0]
# rat = [0.01, 0.015, 0.03, 0.05, 0.075, 0.1]
# r = 0
# for idx in range(0, 6):
#     if i > arr[idx]:
#         r += (i - arr[idx]) * rat[idx]
#         print((i - arr[idx]) * rat[idx])
#         i = arr[idx]
# print(r)

# 自己尝试誊写
p = int(input())
profit = [100, 60, 40, 20, 10, 0]
rate = [0.01, 0.015, 0.03, 0.05, 0.075, 0.1]
award = 0
for k in range(1, 7):
    if p > profit[k - 1]:
        award += (p - profit[k - 1]) * rate[k - 1]
        p = profit[k - 1]
print(award)